tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "koekeishiya/formulae"

brew "git"
brew "neovim", args: ["--HEAD"]
brew "fzf"
brew "rbenv"
brew "pyenv"
brew "nvm"
brew "direnv"
brew "xz"
brew "tmux"
brew "overmind"
brew "ripgrep"
brew "bat"
brew "redis"
brew "yarn"
brew "libxml2"
brew "gh"
brew "universal-ctags"
brew "jdtls"
brew "mailpit"
brew "btop"
brew "openssl@3"
brew "readline"
brew "libyaml"
brew "gmp"
brew "gnu-sed"
brew "skhd"
brew "zsh"
brew "lazygit"
brew "lazydocker"
brew "shared-mime-info"

cask "google-chrome"
cask "firefox"
cask "alt-tab"
cask "raycast"
cask "font-fira-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "tableplus"
cask "insomnia"
cask "qutebrowser"
cask "visual-paradigm"
cask "mos"
cask "docker"
cask "bettertouchtool"
cask "obsidian"
